//Написать программу, которая выведет на консоль «Hello
//world», не используя в исходном коде пробельных символов.

public class task4 {
    public static void main(String[] args) {

        System.out.print("Hello\sworld");
    }
}
